taskt/Core/Automation/Commands/UIAutomationGroup/UIAutomationSearchUIElementFromWindowNameCommand.dot
digraph "UIAutomationSearchUIElementFromWindowNameCommand" {
"UIAutomationSearchUIElementFromWindowNameCommand" -> "ADescendantsSearchAnyUIElementFromWindowNameByTreeWalkerCommands";
"UIAutomationSearchUIElementFromWindowNameCommand" -> "IResultProperties";
"ADescendantsSearchAnyUIElementFromWindowNameByTreeWalkerCommands" -> "ADescendantsSearchUIElementsFromWindowNameByTreeWalkerCommands";
"ADescendantsSearchAnyUIElementFromWindowNameByTreeWalkerCommands" -> "IUIElementIndexProperties";
"ADescendantsSearchUIElementsFromWindowNameByTreeWalkerCommands" -> "ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands";
"ADescendantsSearchUIElementsFromWindowNameByTreeWalkerCommands" -> "IOneWindowNameProperties";
"ADescendantsSearchUIElementsFromWindowNameByTreeWalkerCommands" -> "IUIElementSearchUIElementFromWindowSomethingByAnywayProperties";
"ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands" -> "AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands";
"ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands" -> "IUIElementDescendantsSearchParametersProperties";
"AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands" -> "ScriptCommand";
"AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands" -> "IUIElementChildrenSearchParametersProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
