taskt/Core/Automation/Commands/UIAutomationGroup/UIAutomationSearchUIElementFromWindowNameCommand.puml
@startuml
UIAutomationSearchUIElementFromWindowNameCommand --> ADescendantsSearchAnyUIElementFromWindowNameByTreeWalkerCommands
UIAutomationSearchUIElementFromWindowNameCommand --> IResultProperties
ADescendantsSearchAnyUIElementFromWindowNameByTreeWalkerCommands --> ADescendantsSearchUIElementsFromWindowNameByTreeWalkerCommands
ADescendantsSearchAnyUIElementFromWindowNameByTreeWalkerCommands --> IUIElementIndexProperties
ADescendantsSearchUIElementsFromWindowNameByTreeWalkerCommands --> ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands
ADescendantsSearchUIElementsFromWindowNameByTreeWalkerCommands --> IOneWindowNameProperties
ADescendantsSearchUIElementsFromWindowNameByTreeWalkerCommands --> IUIElementSearchUIElementFromWindowSomethingByAnywayProperties
ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands --> AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands
ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands --> IUIElementDescendantsSearchParametersProperties
AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands --> ScriptCommand
AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands --> IUIElementChildrenSearchParametersProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
